src/Books Review/The C++ Programming Language/The C++ Programming Language Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The C++ Programming Language Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="The C++ Programming Language Notes"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-29 13:03:36 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">The C++ Programming Language Notes</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Overview</a></li>
<li><a href="#sec-2">Preface</a></li>
<li><a href="#sec-3">Chapter 1 Notes to the Reader</a>
<ul>
<li><a href="#sec-3-1">1.3.1</a></li>
<li><a href="#sec-3-2">1.6.1 Suggestions for C Programmers</a></li>
<li><a href="#sec-3-3">1.8 Advice</a></li>
</ul>
</li>
<li><a href="#sec-4">Chapter 2 A Tour of C++</a>
<ul>
<li><a href="#sec-4-1">2.5.4 Abstract Types</a></li>
<li><a href="#sec-4-2">2.7.1 Containers</a></li>
</ul>
</li>
<li><a href="#sec-5">Chapter 3 A Tour of the Standard Library</a></li>
<li><a href="#sec-6">Chapter 4 Types and Declarations</a></li>
<li><a href="#sec-7">Chapter 5 Pointers, Arrays, and Structures</a></li>
<li><a href="#sec-8">Chapter 6 Expressions and Statements</a></li>
<li><a href="#sec-9">Chapter 7 Functions</a></li>
<li><a href="#sec-10">Chapter 8 Namespaces and Exceptions</a></li>
<li><a href="#sec-11">Chapter 9 Source Files and Programs</a></li>
<li><a href="#sec-12">Chapter 10 Classes</a></li>
<li><a href="#sec-13">Chapter 11 Operator Overloading</a></li>
<li><a href="#sec-14">Chapter 12 Derived Classes</a></li>
<li><a href="#sec-15">Chapter 13 Templates</a></li>
<li><a href="#sec-16">Chapter 14 Exceptions Handling</a></li>
<li><a href="#sec-17">Chapter 15 Class Hierarchies</a></li>
<li><a href="#sec-18">Chapter 16 Library Organization and Containers</a></li>
<li><a href="#sec-19">Chapter 17 Standard Containers</a></li>
<li><a href="#sec-20">Chapter 18 Algorithms and Function Objects</a></li>
<li><a href="#sec-21">Chapter 19 Iterators and Allocators</a></li>
<li><a href="#sec-22">Chapter 20 Strings</a></li>
<li><a href="#sec-23">Chapter 21 Streams</a></li>
<li><a href="#sec-24">Chapter 22 Numerics</a></li>
<li><a href="#sec-25">Chapter 23 Developing and Design</a></li>
<li><a href="#sec-26">Chapter 24 Design and Programming</a></li>
<li><a href="#sec-27">Chapter 25 Roles of Classes</a></li>
<li><a href="#sec-28">Appendix A</a></li>
<li><a href="#sec-29">Appendix B</a></li>
<li><a href="#sec-30">Appendix C</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Overview</h2>
<div class="outline-text-2" id="text-1">

<p>Homepage:
<a href="http://iskren.info/reading/info/C++/other/Bjarne Stroustrup Web Site/3rd.html">http://iskren.info/reading/info/C++/other/Bjarne%20Stroustrup%20Web%20Site/3rd.html</a>
</p>
<p>
Bjarne Stroustrup's FAQ:
<a href="http://iskren.info/reading/info/C++/other/Bjarne Stroustrup Web Site/bs_faq.html#SE">http://iskren.info/reading/info/C++/other/Bjarne%20Stroustrup%20Web%20Site/bs_faq.html#SE</a>
</p>
<p>
Code Examples from "The C++ Programming Language"
<a href="http://iskren.info/reading/info/C++/other/Bjarne Stroustrup Web Site/3rd_code.html">http://iskren.info/reading/info/C++/other/Bjarne%20Stroustrup%20Web%20Site/3rd_code.html</a>
</p>
<p>
C++ Solutions
<a href="http://www.vandevoorde.com/C++Solutions/">http://www.vandevoorde.com/C++Solutions/</a>
</p>
<p>
Errata for 5th/15th printing of The C++ Programming Language
<a href="http://www.math.pku.edu.cn/teachers/qiuzy/books/cppl/3rd_printing16.htm">http://www.math.pku.edu.cn/teachers/qiuzy/books/cppl/3rd_printing16.htm</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Preface</h2>
<div class="outline-text-2" id="text-2">

<p>A programmer can partition an application into manageable pieces by
defining new types that closely match the concepts of the application.
This technique for program construction is often called <b>data abstraction</b>.
</p>
<p>
Objects of some user-defined types contain type information. Programs
using objects of such types are often called <b>object based</b>.
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Chapter 1 Notes to the Reader</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">1.3.1</h3>
<div class="outline-text-3" id="text-3-1">

<p>Except for the <code>new</code>, <code>delete</code>, <code>typeid</code>, <code>dynamic_cast</code>, and <code>throw</code>
operators and the <code>try-block</code>, individual C++ expression and
statements need no run-time support.
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">1.6.1 Suggestions for C Programmers</h3>
<div class="outline-text-3" id="text-3-2">

<ol>
<li>Macros are almost never necessary in C++. Use c o n s t (§5.4) or e n u m (§4.8) to define manifest
    constants, i n l i n e (§7.1.1) to avoid function-calling overhead, t e m p l a t e s (Chapter 13) to
    specify families of functions and types, and n a m e s p a c e s (§8.2) to avoid name clashes.
</li>
<li>Don’t declare a variable before you need it so that you can initialize it immediately. A
   declaration can occur anywhere a statement can (§6.3.1), in for-statement initializers
   (§6.3.3), and in conditions (§6.3.2.1).
</li>
<li>Don’t use <code>malloc()</code>. The n e w operator (§6.2.6) does the same job better, and instead of
    r e a l l o c (), try a v e c t o r (§3.8).
</li>
<li>Try to avoid v o i d *, pointer arithmetic, unions, and casts, except deep within the implementation
   of some function or class. In most cases, a cast is an indication of a design error. If
   you must use an explicit type conversion, try using one of the ‘‘new casts’’ (§6.2.7) for a
   more precise statement of what you are trying to do.
</li>
<li>Minimize the use of arrays and C-style strings. The C++ standard library s t r i n g (§3.5) and
   v e c t o r (§3.7.1) classes can often be used to simplify programming compared to traditional C
   style. In general, try not to build yourself what has already been provided by the standard
   library.
</li>
</ol>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">1.8 Advice</h3>
<div class="outline-text-3" id="text-3-3">

<ol>
<li>When you program, you create a concrete representation of the ideas in your solution to some
   problem. Let the structure of the program reflect those ideas as
   directly as possible:
</li>
</ol>


<p class="verse">
[a] If you can think of ‘‘it’’ as a separate idea, make it a class.<br/>
[b] If you can think of ‘‘it’’ as a separate entity, make it an object of some class.<br/>
[c] If two classes have a common interface, make that interface an abstract class.<br/>
[d] If the implementations of two classes have something significant in common, make that commonality a base class.<br/>
[e] If a class is a container of objects, make it a template.<br/>
[f] If a function implements an algorithm for a container, make it a template function implementing the algorithm for a family of containers.<br/>
[g] If a set of classes, templates, etc., are logically related, place them in a common namespace.<br/>
</p>


<ol>
<li>When you define either a class that does not implement either a mathematical entity like a
   matrix or a complex number or a low-level type such as a linked
   list:
</li>
</ol>


<p class="verse">
[a] Don’t use global data (use members).<br/>
[b] Don’t use global functions.<br/>
[c] Don’t use public data members.<br/>
[d] Don’t use friends, except to avoid [a] or [c].<br/>
[e] Don’t put a ‘‘type field’’ in a class; use virtual functions.<br/>
[f] Don’t use inline functions, except as a significant optimization.<br/>
</p>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Chapter 2 A Tour of C++</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">2.5.4 Abstract Types</h3>
<div class="outline-text-3" id="text-4-1">




<pre class="src src-c++"><span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Stack</span>{
<span style="color: #00ffff;">public</span>:
  <span style="color: #00ffff;">virtual</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">push</span>(<span style="color: #98fb98;">char</span> <span style="color: #eedd82;">c</span>) = 0;
  <span style="color: #00ffff;">virtual</span> <span style="color: #98fb98;">char</span> <span style="color: #87cefa;">pop</span>() = 0;
};
</pre>

<p>
The word <b>virtual</b> means "may be redefined later in a class derived
from this one" in Simula and C++.
</p>
<p>
The curious <code>=0</code> syntax says that some class derived from <b>Stack</b> must
define the function.
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">2.7.1 Containers</h3>
<div class="outline-text-3" id="text-4-2">

<p>A class holding a collection of elements of some type is commonly
called a container class, or simply a container.
</p>
<p>
<i>Templates</i> are a <b>compile-time mechanism</b> so that their use incurs no
run-time overhead compared to ‘‘handwritten code.’’
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Chapter 3 A Tour of the Standard Library</h2>
<div class="outline-text-2" id="text-5">


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Chapter 4 Types and Declarations</h2>
<div class="outline-text-2" id="text-6">


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Chapter 5 Pointers, Arrays, and Structures</h2>
<div class="outline-text-2" id="text-7">


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Chapter 6 Expressions and Statements</h2>
<div class="outline-text-2" id="text-8">


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">Chapter 7 Functions</h2>
<div class="outline-text-2" id="text-9">


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">Chapter 8 Namespaces and Exceptions</h2>
<div class="outline-text-2" id="text-10">


</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">Chapter 9 Source Files and Programs</h2>
<div class="outline-text-2" id="text-11">


</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">Chapter 10 Classes</h2>
<div class="outline-text-2" id="text-12">


</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">Chapter 11 Operator Overloading</h2>
<div class="outline-text-2" id="text-13">


</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14">Chapter 12 Derived Classes</h2>
<div class="outline-text-2" id="text-14">


</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15">Chapter 13 Templates</h2>
<div class="outline-text-2" id="text-15">


</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16">Chapter 14 Exceptions Handling</h2>
<div class="outline-text-2" id="text-16">


</div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17">Chapter 15 Class Hierarchies</h2>
<div class="outline-text-2" id="text-17">


</div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18">Chapter 16 Library Organization and Containers</h2>
<div class="outline-text-2" id="text-18">


</div>

</div>

<div id="outline-container-19" class="outline-2">
<h2 id="sec-19">Chapter 17 Standard Containers</h2>
<div class="outline-text-2" id="text-19">


</div>

</div>

<div id="outline-container-20" class="outline-2">
<h2 id="sec-20">Chapter 18 Algorithms and Function Objects</h2>
<div class="outline-text-2" id="text-20">


</div>

</div>

<div id="outline-container-21" class="outline-2">
<h2 id="sec-21">Chapter 19 Iterators and Allocators</h2>
<div class="outline-text-2" id="text-21">


</div>

</div>

<div id="outline-container-22" class="outline-2">
<h2 id="sec-22">Chapter 20 Strings</h2>
<div class="outline-text-2" id="text-22">


</div>

</div>

<div id="outline-container-23" class="outline-2">
<h2 id="sec-23">Chapter 21 Streams</h2>
<div class="outline-text-2" id="text-23">


</div>

</div>

<div id="outline-container-24" class="outline-2">
<h2 id="sec-24">Chapter 22 Numerics</h2>
<div class="outline-text-2" id="text-24">


</div>

</div>

<div id="outline-container-25" class="outline-2">
<h2 id="sec-25">Chapter 23 Developing and Design</h2>
<div class="outline-text-2" id="text-25">


</div>

</div>

<div id="outline-container-26" class="outline-2">
<h2 id="sec-26">Chapter 24 Design and Programming</h2>
<div class="outline-text-2" id="text-26">


</div>

</div>

<div id="outline-container-27" class="outline-2">
<h2 id="sec-27">Chapter 25 Roles of Classes</h2>
<div class="outline-text-2" id="text-27">


</div>

</div>

<div id="outline-container-28" class="outline-2">
<h2 id="sec-28">Appendix A</h2>
<div class="outline-text-2" id="text-28">


</div>

</div>

<div id="outline-container-29" class="outline-2">
<h2 id="sec-29">Appendix B</h2>
<div class="outline-text-2" id="text-29">


</div>

</div>

<div id="outline-container-30" class="outline-2">
<h2 id="sec-30">Appendix C</h2>
<div class="outline-text-2" id="text-30">


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-29 13:03:36 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
